/* eslint-disable */

export default {
  code: 'th',
  messages: {
    alpha: 'ต้องเป็นตัวอักษรเท่านั้น',
    alpha_dash: 'สามารถมีตัวอักษร ตัวเลข ขีด (-) และ underscore (_) เท่านั้น',
    alpha_num: 'ต้องเป็นตัวอักษรและตัวเลขเท่านั้น',
    alpha_spaces: 'ต้องเป็นตัวอักษรและช่องว่างเท่านั้น',
    between: 'ต้องอยู่ระหว่าง {min} และ {max}',
    confirmed: 'ข้อมูลของไม่ตรงกัน',
    digits: 'ต้องเป็นตัวเลข {length} หลักเท่านั้น',
    dimensions: 'ต้องมีขนาด {width}x{height} px',
    email: 'ต้องเป็นอีเมล',
    excluded: 'ต้องเป็นค่าที่กำหนดเท่านั้น',
    ext: 'สกุลไฟล์ไม่ถูกต้อง',
    image: 'ต้องเป็นรูปภาพเท่านั้น',
    oneOf: 'ต้องเป็นค่าที่กำหนดเท่านั้น',
    integer: 'ต้องเป็นเลขจำนวนเต็ม',
    length: 'ต้องมีความยาว {length} ตัวอักษร',
    max: 'ต้องมีความยาวไม่เกิน {length} ตัวอักษร',
    max_value: 'ต้องมีค่าไม่เกิน {max}',
    mimes: 'ประเภทไฟล์ไม่ถูกต้อง',
    min: 'ต้องมีความยาวอย่างน้อย {length} ตัวอักษร',
    min_value: 'ต้องมีค่าตั้งแต่ {min} ขึ้นไป',
    numeric: 'ต้องเป็นตัวเลขเท่านั้น',
    regex: 'รูปแบบข้อมูลไม่ถูกต้อง',
    required: 'จำเป็นต้องกรอก',
    required_if: 'จำเป็นต้องกรอก',
    size: 'ต้องมีขนาดไฟล์ไม่เกิน {size}KB'
  }
};
